CALL add_speciality_code(
	"15.02.07"
);

CALL add_speciality_code(
	 "09.02.03"
);

CALL add_speciality_code(
	"15.02.14"
);

CALL add_speciality(
	1,
	"Автоматизация технологических процессов и производств (по отраслям)"
);

CALL add_general_competetion(
	1,
	1,
	"Общая компетенция №1.1",
	"Умение 1.1",
	"Знание 1.1"
);
CALL add_general_competetion(
	1,
	 2,
	"Общая компетенция №1.2",
	"Умение 1.2",
	"Знание 1.2"
);

CALL add_professional_competetion(
	1,
	1,
	1,
	"Профессиональная компетенция №1.1",
	"Знание 1.1",
	"Умение 1.1",
	"Опыт 1.1"
);

CALL add_professional_competetion(
	1,
	1,
	2,
	"Профессиональная компетенция №1.2",
	"Знание 1.2",
	"Умение 1.2",
	"Опыт 1.2"
);

CALL add_professional_competetion(
	1,
	2,
	1,
	"Профессиональная компетенция №2.1",
	"Знание 2.1",
	"Умение 2.1",
	"Опыт 2.1"
);

CALL add_professional_competetion(
	1,
	2,
	2,
	"Профессиональная компетенция №2.2",
	"Знание 2.2",
	"Умение 2.2",
	"Опыт 2.2"
);

CALL add_speciality(
	2,
	"Программирование в компьютерных системах"
);

CALL add_general_competetion(
	2,
	1,
	"Общая компетенция №1.1",
	"Умение 1.1",
	"Знание 1.1"
);
CALL add_general_competetion(
	2,
	2,
	"Общая компетенция №1.2",
	"Умение 1.2",
	"Знание 1.2"
);

CALL add_professional_competetion(
	2,
	1,
	1,
	"Профессиональная компетенция №1.1",
	"Знание 1.1",
	"Умение 1.1",
	"Опыт 1.1"
);

CALL add_professional_competetion(
	2,
	1,
	2,
	"Профессиональная компетенция №1.2",
	"Знание 1.2",
	"Умение 1.2",
	"Опыт 1.2"
);

CALL add_professional_competetion(
	2,
	2,
	1,
	"Профессиональная компетенция №2.1",
	"Знание 2.1",
	"Умение 2.1",
	"Опыт 2.1"
);

CALL add_professional_competetion(
	2,
	2,
	2,
	"Профессиональная компетенция №2.2",
	"Знание 2.2",
	"Умение 2.2",
	"Опыт 2.2"
);

CALL add_speciality(
	3,
   "Оснащение средствами автоматизации технологических процессов и производств (по отраслям)"
);

CALL add_general_competetion(
	3,
	1,
	"Выбирать способы решения задач профессиональной деятельности, применительно к различным контекстам.",
	"",
	""
);

CALL add_general_competetion(
	3,
	2,
	"Осуществлять поиск, анализ и интерпретацию информации, необходимой для выполнения задач профессиональной деятельности.",
	"",
	""
);

CALL add_general_competetion(
	3,
	3,
	"Планировать и реализовывать собственное профессиональное и личностное развитие.",
	"",
	""
);

CALL add_general_competetion(
	3,
	4,
	"Работать в коллективе и команде, эффективно взаимодействовать с коллегами, руководством, клиентами.",
	"",
	""
);

CALL add_general_competetion(
	3,
	5,
	"Осуществлять устную и письменную коммуникацию на государственном языке с учетом особенностей социального и культурного контекста.",
	"",
	""
);

CALL add_general_competetion(
	3,
	6,
	"Проявлять гражданско-патриотическую позицию, демонстрировать осознанное поведение на основе традиционных общечеловеческих ценностей.",
	"",
	""
);

CALL add_general_competetion(
	3,
	7,
	"Использовать информационные технологии в профессиональной деятельности.",
	"",
	""
);

CALL add_general_competetion(
	3,
	8,
	"Пользоваться профессиональной документацией на государственном и иностранном языках.",
	"",
	""
);

CALL add_professional_competetion(
	3,
	1,
	1,
	"Осуществлять анализ имеющихся решений для выбора программного обеспечения для создания и тестирования модели элементов систем автоматизации на основе технического задания,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	1,
	2,
	"Разрабатывать виртуальную модель элементов систем автоматизации на основе выбранного программного обеспечения и технического задания,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	1,
	3,
	"Формировать пакет технической документации на разработанную модель элементов систем автоматизации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	2,
	1,
	"Осуществлять выбор оборудования и элементной базы систем автоматизации в соответствии с заданием и требованием разработанной технической документации на модель элементов систем автоматизации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	2,
	2,
	"Осуществлять монтаж и наладку модели элементов систем автоматизации на основе разработанной технической документации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	2,
	3,
	"Проводить испытания модели элементов систем автоматизации в реальных условиях с целью подтверждения работоспособности и возможной оптимизации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	3,
	1,
	"Планировать работы по монтажу, наладке и техническому обслуживанию систем и средств автоматизации на основе организационно-распорядительных документов и требований технической документации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	3,
	2,
	"Организовывать материально-техническое обеспечение работ по монтажу, наладке и техническому обслуживанию систем и средств автоматизации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	3,
	3,
	"Разрабатывать инструкции и технологические карты выполнения работ для подчиненного персонала по монтажу, наладке и техническому обслуживанию систем и средств автоматизации,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	3,
	4,
	"Организовывать выполнение производственных заданий подчиненным персоналом,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	3,
	5,
	"Контролировать качество работ по монтажу, наладке и техническому обслуживанию систем и средств автоматизации, выполняемых подчиненным персоналом и соблюдение норм охраны труда и бережливого производства,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	4,
	1,
	"Контролировать текущие параметры и фактические показатели работы систем автоматизации в соответствии с требованиями нормативно-технической документации для выявления возможных отклонений,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	4,
	2,
	"Осуществлять диагностику причин возможных неисправностей и отказов систем для выбора методов и способов их устранения,
	",
	"",
	"",
	""
);

CALL add_professional_competetion(
	3,
	4,
	3,
	"Организовывать работы по устранению неполадок, отказов оборудования и ремонту систем в рамках своей компетенции,
	",
	"",
	"",
	""
);